app/Controllers/Board.php

    public function show($id)
    {
        $boardModel = new BoardModel();
        $BoardcmtModel = new BoardcmtModel();
        $session = session();

        #동일접속자 조회수 중복증가 방지 세션처리
        $sessionViewKey = 'board_view_' . $id;
        if (!$session->has($sessionViewKey)) {
            $session->set($sessionViewKey, true);
            #조회수 업데이트
            $boardModel->set('viewcount', 'viewcount + 1', false)
                    ->where('id', $id)
                    ->update();
---
UPDATE `boards` SET `viewcount` = viewcount + 1, `modifydate` = '2025-10-02 03:56:02'
WHERE `id` = '125'