app/Controllers/Json.php

    function recommend()
    {
        $session = session();
        $id = $this->request->getGet('id');
        $mode = $this->request->getGet('mode');

        if (!$session->get('userid')) { //로그인 정보 없음
            return $this->response->setJSON(['errorflag' => 'u']);
        }else{
            $boardUcntsModel = new BoardUcntsModel();
            $boardDcntsModel = new BoardDcntsModel();

            $board = $id;
            $users = $session->get('uid');
            $userid = $session->get('userid');

            $ucnt = $boardUcntsModel->getBoardUcnts($board, $users);
            $Dcnt = $boardDcntsModel->getBoardDcnts($board, $users);

            if($ucnt > 0 || $Dcnt > 0) { //이미 추천/비추천 한 경우
                return $this->response->setJSON(['errorflag' => 'x']);
                exit;
            }

            if($mode == "u") {          //추천
                $boardUcntsModel->insert(['board' => $board, 'users' => $users, 'userid' => $userid]);
---
INSERT INTO `board_ucnts` (`board`, `users`, `userid`) VALUES ('146', '1', 'kjw9979')