app/Controllers/User.php

	public function login()
	{
        $session = session();
        $userModel = new UserModel();

        $userid = $this->request->getPost('userid');
        $password = $this->request->getPost('password');
        $referpage = $this->request->getPost('referpage');    //로그인폼의 이전 페이지

        $rs = $userModel->where('userid', $userid)->first();
---
SELECT *
FROM `users`
WHERE `userid` = 'kjw9979'
 LIMIT 1