app/Models/BoardDcntsModel.php

SELECT COUNT(*) AS `numrows`
FROM `board_dcnts`
WHERE `board` = '146'
AND `users` = '1'
---
    function getBoardDcnts($board, $users)
    {
        return $this->where('board', $board)
                    ->where('users', $users)
                    ->countAllResults();