app/Models/BoardUcntsModel.php

SELECT COUNT(*) AS `numrows`
FROM `board_ucnts`
WHERE `board` = '146'
AND `users` = '1'
---
    function getBoardUcnts($board, $users)
    {
        return $this->where('board', $board)
                    ->where('users', $users)
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `board_ucnts`
WHERE `board` = '146'
---
    function getBoardUcntsAll($board)
    {
        return $this->where('board', $board)
                    ->countAllResults();