app/Models/BoardCmtModel.php

SELECT `boardcmts`.*, `users`.`nickname`, `users`.`userid`
FROM `boardcmts`
JOIN `users` ON `boardcmts`.`users` = `users`.`id`
WHERE `boardcmts`.`board` = '125'
ORDER BY `boardcmts`.`gid` ASC, `boardcmts`.`orderno` ASC
---
    public function getBoardcmts($id)
    {
        return $this->select('boardcmts.*, users.nickname, users.userid')
                    ->join('users', 'boardcmts.users = users.id')
                    ->where('boardcmts.board', $id)
                    ->orderBy('boardcmts.gid', 'ASC')
                    ->orderBy('boardcmts.orderno', 'ASC')
                    ->findAll(); //페이징 없을 때