app/Models/BoardModel.php

    public function getBoards_list($boardmaster = 1, $limit = 10, $search = null, $catetag = null)
    {
        $sql = $this->select('
                            boards.id, boards.title, boards.tag, boards.viewcount, boards.inputdate, boards.notice
                            , u.nickname
                            , COUNT(DISTINCT b.id) as cmcnt
                            , COUNT(c.id) AS upcnt
                            , COUNT(d.id) AS downcnt
                            ')
                    ->join('users u', 'boards.users = u.id')
                    ->join('boardCmts b', 'boards.id = b.board', 'left')
                    ->join('board_ucnts c', 'boards.id = c.board', 'left')
                    ->join('board_dcnts d', 'boards.id = d.board', 'left')
                    ->where("boards.boardmaster", $boardmaster);
                    if (!empty($search)) {
                        $sql->groupStart()
                                ->like('boards.title', $search)
                                ->orLike('boards.contents', $search)
                            ->groupEnd();
                    }
                    if(!empty($catetag))
                        $sql->where('tag', $catetag);

                    $sql->groupBy('boards.id, boards.title, boards.tag, boards.viewcount, boards.inputdate, boards.notice, u.nickname')
                        ->orderBy('boards.notice', 'DESC')
                        ->orderBy('boards.id', 'DESC');
        return $sql->paginate($limit);
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `boards`.`id`, `boards`.`title`, `boards`.`viewcount`, `boards`.`inputdate`, `u`.`nickname`, COUNT(DISTINCT b.id) as cmcnt, COUNT(c.id) AS upcnt, COUNT(d.id) AS downcnt
FROM `boards`
JOIN `users` `u` ON `boards`.`users` = `u`.`id`
LEFT JOIN `boardCmts` `b` ON `boards`.`id` = `b`.`board`
LEFT JOIN `board_ucnts` `c` ON `boards`.`id` = `c`.`board`
LEFT JOIN `board_dcnts` `d` ON `boards`.`id` = `d`.`board`
WHERE `boards`.`boardmaster` = '1'
GROUP BY `boards`.`id`, `boards`.`title`, `boards`.`viewcount`, `boards`.`inputdate`, `u`.`nickname`
) CI_count_all_results
SELECT `boards`.`id`, `boards`.`title`, `boards`.`viewcount`, `boards`.`inputdate`, `u`.`nickname`, COUNT(DISTINCT b.id) as cmcnt, COUNT(c.id) AS upcnt, COUNT(d.id) AS downcnt
FROM `boards`
JOIN `users` `u` ON `boards`.`users` = `u`.`id`
LEFT JOIN `boardCmts` `b` ON `boards`.`id` = `b`.`board`
LEFT JOIN `board_ucnts` `c` ON `boards`.`id` = `c`.`board`
LEFT JOIN `board_dcnts` `d` ON `boards`.`id` = `d`.`board`
WHERE `boards`.`boardmaster` = '1'
GROUP BY `boards`.`id`, `boards`.`title`, `boards`.`viewcount`, `boards`.`inputdate`, `u`.`nickname`
ORDER BY `boards`.`id` DESC
 LIMIT 10

    public function getBoards_view($id, $userid = null)
    {
        return $this->select('
                              boards.id, boards.title, boards.contents, boards.viewcount, boards.inputdate, boards.users, u.nickname, u.userid, bk.userid as bookid
                            , COUNT(DISTINCT b.id) as cmcnt
                            , COUNT(DISTINCT c.id) AS upcnt
                            , COUNT(DISTINCT d.id) AS downcnt
                            ')
                    ->join('users u', 'boards.users = u.id') // boards.users = 회원 id
                    ->join('boardCmts b', 'boards.id = b.board', 'left')
                    ->join('board_ucnts c', 'boards.id = c.board', 'left')
                    ->join('board_dcnts d', 'boards.id = d.board', 'left')
                    ->join('board_bmks bk',
                        $userid !== null
                            ? "boards.id = bk.board and bk.userid = " . $this->db->escape($userid)
                            : "boards.id = bk.board ",
                            'left'
                    )
                    ->where('boards.id', $id)
                    ->groupBy('boards.id, boards.title, boards.contents, boards.viewcount, boards.users, boards.inputdate, u.nickname, u.userid, bk.userid')
                    ->first();
---
SELECT `boards`.`id`, `boards`.`title`, `boards`.`contents`, `boards`.`viewcount`, `boards`.`inputdate`, `boards`.`users`, `u`.`nickname`, `u`.`userid`, `bk`.`userid` as `bookid`, COUNT(DISTINCT b.id) as cmcnt, COUNT(DISTINCT c.id) AS upcnt, COUNT(DISTINCT d.id) AS downcnt
FROM `boards`
JOIN `users` `u` ON `boards`.`users` = `u`.`id`
LEFT JOIN `boardCmts` `b` ON `boards`.`id` = `b`.`board`
LEFT JOIN `board_ucnts` `c` ON `boards`.`id` = `c`.`board`
LEFT JOIN `board_dcnts` `d` ON `boards`.`id` = `d`.`board`
LEFT JOIN `board_bmks` `bk` ON `boards`.`id` = `bk`.`board` and `bk`.`userid` = 'kjw9979'
WHERE `boards`.`id` = '125'
GROUP BY `boards`.`id`, `boards`.`title`, `boards`.`contents`, `boards`.`viewcount`, `boards`.`users`, `boards`.`inputdate`, `u`.`nickname`, `u`.`userid`, `bk`.`userid`
ORDER BY `boards`.`id` ASC
 LIMIT 1